Documents/ПервоеПеремещениеТерминала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ПервоеПеремещениеТерминала</Name>
			<BasedOn>
				<xr:Item>Catalog.Терминалы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвижениеТерминалов</xr:Item>
				<xr:Item>InformationRegister.СвязиТерминаловИДоговоров</xr:Item>
				<xr:Item>InformationRegister.СведенияОДоговорАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущееНазваниеТерминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАрендыВвод</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПеремТермин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвижениеТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеТерминалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Эксплуатация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАрендРегистр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДействующиеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДействующиеДоговора</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПервоеПеремещениеТерминала/Forms/ФормаДокумента/Ext/Form/Module.bsl
//Процедуры обработки событий формы
#Область ПроцедурыФормы

	// Процедура - Подготовки формы при её открытии
	//
	// Параметры:
	//  Отказ	 - Булево	 - Индикатор определяющий будет ли открыта форма
	//
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		ПриОткрытииНаСервере();
		ПроверитьТерминал();
	КонецПроцедуры

	
	// Процедура - Получение необходимых данных с сервера для открытия формы
//
	&НаСервере
	Процедура ПриОткрытииНаСервере()
		Объект.Дата = ТекущаяДата();
	КонецПроцедуры

#КонецОбласти

//Процедуры обработки событий реквизитов формы
#Область КомандыДляКнопок
	
	//ПЕЧАТЬ ДОКУМЕНТА
	&НаСервере
	Процедура КнопкаПечатьНаСервере()
		//ТаблДок = новый ТабличныйДокумент;
		//Макет = ПолучитьМакетОформления("ПечатьВводВЭксплуатацию");
		//ТаблДок.Вывести();
		//ТаблДок.Показать("Ввод в эксплуатацию терминала"+Объект.ТекущееНазваниеТерминала)
	КонецПроцедуры

	&НаКлиенте
	Процедура КнопкаПечать(Команда)
		КнопкаПечатьНаСервере();
	КонецПроцедуры
	
#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура ПеремОткПриИзменении(Элемент)
		ПроверитьТерминал();
	КонецПроцедуры

	&НаКлиенте
	Процедура ПроверитьТерминал()
		Если ЗначениеЗаполнено(Объект.ТекущееНазваниеТерминала) Тогда
			пр = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
			если пр.Эксплуатация тогда                         
				Объект.ТекущееНазваниеТерминала = null;
		 		Сообщить("Данный терминал уже эксплуатируется")
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ДоговорАрендыВводНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьПереченьДействующихДоговоров(Объект.Дата);
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести
	
	// Функция - Получения последних данных по выбранному терминалу
	//
	// Параметры:
	//  Терминал - СправочникСсылка.Терминалы	 - Терминал по которому необходимо получить данные
	//  Дата	 - Дата	 - Дата на которую данные должны быть актуальны
	// 
	// Возвращаемое значение:
	//  Структура - Данные из регистра сведений движение терминалов
	//
	&НаСервере
	Функция ПолучитьТД(Терминал, Дата)
		Отбор = Новый Структура;
		Отбор.Вставить("Терминал",Терминал);
		Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
		Возврат Данные;
	КонецФункции

	// Функция - Получения переченя действующих договоров на определенную дату
	//
	// Параметры:
	//  Дата - Дата	 - Время на которое нужно получить действующие договора
	// 
	// Возвращаемое значение:
	//  СписокЗначений - Список действующих договоров
	//
	&НаСервере
	Функция ПолучитьПереченьДействующихДоговоров(Дата);
		Запрос = Новый Запрос("ВЫБРАТЬ
	    |	ДействующиеДоговораСрезПоследних.Договор КАК Договор
	    |ИЗ
	    |	РегистрСведений.ДействующиеДоговора.СрезПоследних КАК ДействующиеДоговораСрезПоследних
	    |ГДЕ
	    |	ДействующиеДоговораСрезПоследних.Период <= &Дата");
		Запрос.УстановитьПараметр("Дата", Дата);
		Список = Новый СписокЗначений;
		МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
		Для Каждого Значение Из МассивЗначений Цикл
			Список.Добавить(Значение, Значение.Номер+", "+Значение.Дата+", Адрес: "+Значение.АдресУстановки);
		КонецЦикла;                           
		Возврат Список;
	КонецФункции

#КонецОбласти
